In [1]:
import pandas as pd
import numpy as np

# Read the dateframe

In [2]:
df = pd.read_csv('store_1_stock.csv', index_col=0)

In [3]:
df.head(2) # first 2 rows

         Quantity   Color  Price_per_kg
Apples         20     Red             3
Bananas        30  Yellow             2

In [4]:
df.tail(2) # last 2 rows

          Quantity  Color  Price_per_kg
Cherries        15    Red             4
Dates           10  Brown             5

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Apples to Dates
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Quantity      4 non-null      int64
 1   Color         4 non-null      object
 2   Price_per_kg  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [6]:
df.describe()

        Quantity  Price_per_kg
count   4.000000      4.000000
mean   18.750000      3.500000
std     8.539126      1.290994
min    10.000000      2.000000
25%    13.750000      2.750000
50%    17.500000      3.500000
75%    22.500000      4.250000
max    30.000000      5.000000

# Indexing the dateframe

In [7]:
# LOC - selecting row by the index value
df.loc['Dates']

Quantity           10
Color           Brown
Price_per_kg        5
Name: Dates, dtype: object

In [8]:
# ILOC - selecting row by the numerical index
df.iloc[0]

Quantity         20
Color           Red
Price_per_kg      3
Name: Apples, dtype: object

In [9]:
# Slicing
df[0:3][['Color', 'Quantity']]

           Color  Quantity
Apples       Red        20
Bananas   Yellow        30
Cherries     Red        15

## Adding, Renaming, Removing

In [10]:
df['Country'] = ['USA', 'Canada', 'USA', 'USA']

In [11]:
df

          Quantity   Color  Price_per_kg Country
Apples          20     Red             3     USA
Bananas         30  Yellow             2  Canada
Cherries        15     Red             4     USA
Dates           10   Brown             5     USA

In [12]:
df.rename(columns={'Price_per_kg': 'Price'}, inplace=True)

In [13]:
df

          Quantity   Color  Price Country
Apples          20     Red      3     USA
Bananas         30  Yellow      2  Canada
Cherries        15     Red      4     USA
Dates           10   Brown      5     USA

In [14]:
# axis 1 - columns
df.drop('Country', axis=1, inplace=True)

In [15]:
df

          Quantity   Color  Price
Apples          20     Red      3
Bananas         30  Yellow      2
Cherries        15     Red      4
Dates           10   Brown      5

# Changing the data inside columns

In [16]:
df['Quantity'] * 2

Apples      40
Bananas     60
Cherries    30
Dates       20
Name: Quantity, dtype: int64

In [17]:
df['Quantity'] = df['Quantity'] * 2

In [18]:
df

          Quantity   Color  Price
Apples          40     Red      3
Bananas         60  Yellow      2
Cherries        30     Red      4
Dates           20   Brown      5

# Nan values

In [19]:
df.isna()

          Quantity  Color  Price
Apples       False  False  False
Bananas      False  False  False
Cherries     False  False  False
Dates        False  False  False

In [20]:
df['Quantity'] = df['Quantity'].astype('float16')

In [21]:
df['Quantity']

Apples      40.0
Bananas     60.0
Cherries    30.0
Dates       20.0
Name: Quantity, dtype: float16

In [22]:
df.min()

Quantity     20.0
Color       Brown
Price           2
dtype: object

In [23]:
df.max()

Quantity      60.0
Color       Yellow
Price            5
dtype: object

# Exercise 4

In [24]:
quantity_sum = df['Quantity'].sum()

In [25]:
quantity_sum

150.0

In [26]:
df['Quantity'] = df['Quantity'].astype('float')

In [27]:
df.nlargest(3, 'Quantity')

          Quantity   Color  Price
Bananas       60.0  Yellow      2
Apples        40.0     Red      3
Cherries      30.0     Red      4

# Exercise 5

In [28]:
df.loc['Bananas', 'Quantity']

60.0

In [29]:
df.iloc[1]['Quantity']

60.0

# Exercise 6

In [30]:
df['Sale_price'] = df['Price'] * 0.1
df.rename(columns={'Price': 'Original_price'}, inplace=True)

In [31]:
df.drop('Color', axis=1, inplace=True)

In [32]:
df

          Quantity  Original_price  Sale_price
Apples        40.0               3         0.3
Bananas       60.0               2         0.2
Cherries      30.0               4         0.4
Dates         20.0               5         0.5

# Exercise 7

In [33]:
new_data = pd.DataFrame({
    "Quantity": [np.nan],
    "Original_price": [3.5],
    "Sale_price": [0.3]}, index=['Grapes'])
df = pd.concat([df, new_data])

In [34]:
df

          Quantity  Original_price  Sale_price
Apples        40.0             3.0         0.3
Bananas       60.0             2.0         0.2
Cherries      30.0             4.0         0.4
Dates         20.0             5.0         0.5
Grapes         NaN             3.5         0.3

# Exercise 8

In [35]:
df['Quantity'].dtype

dtype('float64')

# Exercise 9

In [36]:
df['Quantity'].sum()

150.0

In [44]:
df['Quantity'].idxmax()

'Bananas'

In [45]:
df['Quantity'][df['Quantity'].idxmax()]

60.0

In [47]:
df['Quantity'].idxmin()

'Dates'

In [48]:
df['Quantity'][df['Quantity'].idxmin()]

20.0

In [50]:
df['Original_price'].mean()

3.5